#ifndef  __AMMETER_SET_H__
#define  __AMMETER_SET_H__

 #include "stm32f10x.h"


  //void usart_Init(void);  //  串口初始化
   void	SPI1_Init(void);	// SPI 初始化
  extern void SPI1_Master_Init(void);	 //
  extern void ammeter_Init(void);	 //电流表设置初始化
 
  /*********************************************
 	函数功能：发送电压通道1的上限电压值。 
	参数:  mv为数值参数
			 
 ***********************************************/
 extern void set_max_VDD1_val(unsigned int mv);	

 
  /*********************************************
 	函数功能：发送电压通道2的上限电压值。 
	参数:  mv为数值参数
			 
 ***********************************************/
 extern void set_max_VDD2_val(unsigned int mv);	

 
  /*********************************************
 	函数功能：发送电压通道3的上限电压值。 
	参数:  mv为数值参数
			 
 ***********************************************/
 extern void set_max_VDD3_val(unsigned int mv);	

  /*********************************************
 	函数功能：发送电压通道4的上限电压值。 
	参数:  mv为数值参数
			 
 ***********************************************/
 extern void set_max_VDD4_val(unsigned int mv);	

  
  /*********************************************
 	函数功能：发送电压通道5的上限电压值。 
	参数:  mv为数值参数
			 
 ***********************************************/
 extern void set_max_VDD5_val(unsigned int mv);	

 
  /*********************************************
 	函数功能：发送电压通道6的上限电压值。 
	参数:  mv为数值参数
			 
 ***********************************************/
 extern void set_max_VDD6_val(unsigned int mv);	

  
  /*********************************************
 	函数功能：发送电流通道1的上限电流值。 
	参数:  mA为数值参数		 
 ***********************************************/
  extern void set_max_curr1_val(unsigned int mA);	    

    /*********************************************
 	函数功能：发送电流通道2的上限电流值。 
	参数:  mA为数值参数		 
 ***********************************************/
  extern void set_max_curr2_val(unsigned int mA);	  

  /*********************************************
 	函数功能：发送电流通道3的上限电流值。 
	参数:  mA为数值参数		 
 ***********************************************/
  extern void set_max_curr3_val(unsigned int mA);	  

   /*********************************************
 	函数功能：发送电流通道4的上限电流值。 
	参数:  mA为数值参数		 
 ***********************************************/
  extern void set_max_curr4_val(unsigned int mA);	   

  /*********************************************
 	函数功能：发送电流通道5的上限电流值。 
	参数:  mA为数值参数		 
 ***********************************************/
  extern void set_max_curr5_val(unsigned int mA);	   

    /*********************************************
 	函数功能：发送电流通道6的上限电流值。 
	参数:  mA为数值参数		 
 ***********************************************/
  extern void set_max_curr6_val(unsigned int mA);	  

  //---------下限---
 /*********************************************
 	函数功能：发送电压通道1的下限电压值。 
	参数:  mv为数值参数	 
 ***********************************************/
 extern void set_min_VDD1_val(unsigned int mv);  
/*********************************************
 	函数功能：发送电压通道2的下限电压值。 
	参数:  mv为数值参数	 
 ***********************************************/
 extern void set_min_VDD2_val(unsigned int mv); 
/*********************************************
 	函数功能：发送电压通道3的下限电压值。 
	参数:  mv为数值参数	 
 ***********************************************/
 extern void set_min_VDD3_val(unsigned int mv); 
 /*********************************************
 	函数功能：发送电压通道4的下限电压值。 
	参数:  mv为数值参数	 
 ***********************************************/
 extern void set_min_VDD4_val(unsigned int mv);  
/*********************************************
 	函数功能：发送电压通道5的下限电压值。 
	参数:  mv为数值参数	 
 ***********************************************/
 extern void set_min_VDD5_val(unsigned int mv);  
 /*********************************************
 	函数功能：发送电压通道6的下限电压值。 
	参数:  mv为数值参数	 
 ***********************************************/
 extern void set_min_VDD6_val(unsigned int mv);  

 //-------min_I1---------------------
   
 /*********************************************
 	函数功能：发送电流通道1的下限电流值。 
	参数:  mA为数值参数		 
 ***********************************************/
  extern void set_min_curr1_val(unsigned int mA);	   

  /*********************************************
 	函数功能：发送电流通道2的下限电流值。 
	参数:  mA为数值参数		 
 ***********************************************/
  extern void set_min_curr2_val(unsigned int mA);	    

  /*********************************************
 	函数功能：发送电流通道3的下限电流值。 
	参数:  mA为数值参数		 
 ***********************************************/
  extern void set_min_curr3_val(unsigned int mA);	    

  /*********************************************
 	函数功能：发送电流通道4的下限电流值。 
	参数:  mA为数值参数		 
 ***********************************************/
  extern void set_min_curr4_val(unsigned int mA);		 
   /*********************************************
 	函数功能：发送电流通道5的下限电流值。 
	参数:  mA为数值参数		 
 ***********************************************/
  extern void set_min_curr5_val(unsigned int mA);		  

   /*********************************************
 	函数功能：发送电流通道6的下限电流值。 
	参数:  mA为数值参数		 
 ***********************************************/
  extern void set_min_curr6_val(unsigned int mA);		   
 
 //--发送字符-------
 /*********************************************
 	函数功能：发送中文文本。 
	参数:    x,y 为文本的起始坐标
			 *chars为文本内容
 ***********************************************/
   extern void send_NO(unsigned int n,unsigned char *chars);//转送版本信息,n是版本号字节数
  /*********************************************
 	函数功能：发送中文文本。 
	参数:    x,y 为文本的起始坐标
			 *chars为文本内容
 ***********************************************/
   extern void message(unsigned int x,unsigned int y,unsigned char *chars);  //传送大的字母文本信息，在第二页显示，x，y是显示内容的起地址
 /*********************************************
 	函数功能：发送中文文本。 
	参数:    x,y 为文本的起始坐标
			 *chars为文本内容
 ***********************************************/
   extern void mess_word(unsigned int x,unsigned int y,unsigned char *chars);  
 

 //-------------控制PE--------
 /*********************************************
 	函数功能：发送改变电流表通道1的量程的指令 
	参数:    n 为1时 为uA量程  
			 n为0时  为mA量程
 ***********************************************/
 extern void set_chl_range_1(unsigned int n);

 /*********************************************
 	函数功能：发送改变电流表通道2的量程的指令 
	参数:    n 为1时 为uA量程  
			 n为0时  为mA量程
 ***********************************************/
 extern void set_chl_range_2(unsigned int n);

 /*********************************************
 	函数功能：发送改变电流表通道3的量程的指令 
	参数:    n 为1时 为uA量程  
			 n为0时  为mA量程
 ***********************************************/
 extern void set_chl_range_3(unsigned int n);
 
 /*********************************************
 	函数功能：发送改变电流表通道4的量程的指令 
	参数:    n 为1时 为uA量程  
			 n为0时  为mA量程
 ***********************************************/	
 extern void set_chl_range_4(unsigned int n);

/*********************************************
 	函数功能：发送改变电流表通道5的量程的指令 
	参数:    n 为1时 为uA量程  
			 n为0时  为mA量程
 ***********************************************/	 
 extern void set_chl_range_5(unsigned int n);

/*********************************************
 	函数功能：发送改变电流表通道6的量程的指令 
	参数:    n 为1时 为uA量程  
			 n为0时  为mA量程
 ***********************************************/	 
 extern void set_chl_range_6(unsigned int n);	 

  #endif
