/******************************* 广州天码电子 *********************************
 * 文件名   ：usart1.c        
 * 作者     ：天码电子
 * 版本     ：V01
 * 完成日期 ：2014 
 * 描述     ：配置USART1 115200 8bit 無奇偶校驗 1停止位 ,重定向printf
 * 修改记录 ：|    作者    |   日期    |    版本    |    描述    |	
*******************************************************************************/

#ifndef __USART1_H
#define	__USART1_H

#include "stm32f10x.h"
#include <stdio.h>

void USART1_Init(void);


#endif /* __USART1_H */

/******************************* 广州天码电子 *********************************/
